In [1]:
import numpy as np 
import pandas as pd 
from pandas import Series ,DataFrame

In [5]:
ser1 = Series ([0,1,2],index=['a','b','c'])

In [6]:
ser2 = Series ([3,4,5,6],index=['a','b','c','d'])

In [9]:
ser1+ser2

a    3.0
b    5.0
c    7.0
d    NaN
dtype: float64

In [10]:
dframe1 = DataFrame(np.arange(4).reshape((2,2)) ,columns = list('AB'), index = ['nyc','la'] )
dframe1

     A  B
nyc  0  1
la   2  3

In [15]:
dframe2 = DataFrame(np.arange(9).reshape((3,3)), columns = list('ADC'),index=['nyc','la','sf'])
dframe2

     A  D  C
nyc  0  1  2
la   3  4  5
sf   6  7  8

In [16]:
dframe1 + dframe2

       A   B   C   D
la   5.0 NaN NaN NaN
nyc  0.0 NaN NaN NaN
sf   NaN NaN NaN NaN

In [17]:
dframe1.add(dframe2,fill_value=0)

       A    B    C    D
la   5.0  3.0  5.0  4.0
nyc  0.0  1.0  2.0  1.0
sf   6.0  NaN  8.0  7.0

In [18]:
ser3 = dframe2.ix[0]

/home/diganta/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [19]:
ser3

A    0
D    1
C    2
Name: nyc, dtype: int64

In [20]:
dframe2-ser3

     A  D  C
nyc  0  0  0
la   3  3  3
sf   6  6  6